cases/multiphaseEjector/Euler/0/U.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volVectorField;
    location        "0";
    object          U.water;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inletMain
    {
        type            uniformFixedValue;
        uniformValue    table ((0 ( 0 0 0 )) (0.01 (2 0 0)));
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    inletSecondary
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    wallNozzle1
    {
        type            noSlip;
    }
    wallNozzle2
    {
        type            noSlip;
    }
    wallDiffuser
    {
        type            noSlip;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
