cases/multiphaseEjector/Euler/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volScalarField;
    location        "0";
    object          p_rgh;
}

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 1e5;

boundaryField
{
    inletMain
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    inletSecondary
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    wallNozzle1
    {
        type            fixedFluxPressure;
	value		uniform 1e5;
    }
    wallNozzle2
    {
        type            fixedFluxPressure;
	value		uniform 1e5;
    }
    wallDiffuser
    {
        type            fixedFluxPressure;
        value           uniform 1e5; 
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    walls
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
}


// ************************************************************************* //
