cases/multiphaseEjector/Euler/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-06;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxAlphaCo      1;

maxDeltaT       0.1;

functions
{
    flowRatePatch
    {
        name            inletSecondary;
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             false;
        regionType      patch;
        fields          ( phi );
        operation       sum;
    }
    flowRatePatchMain
    {
        name            inletMain;
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             false;
        regionType      patch;
        fields          ( phi );
        operation       sum;
    }
    patchAverage
    {
        name            inletMain;
        fields          ( p );
        operation       areaAverage;
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             false;
        regionType      patch;
    }
    solverInfo
    {
        type            solverInfo;
        libs            ( utilityFunctionObjects );
        writeControl    timeStep;
        writeInterval   1;
        fields          ( U.air U.water p_rgh km epsilonm );
    }
}


// ************************************************************************* //
